export interface Q {
    q: string;
    a: string[];
    rightAnswerIndex: number; //Начинается с 0
}

export const questions: Q[] = [{
    q: "Сколько будет дважды два?",
    a: ["1", "2", "3", "4"],
    rightAnswerIndex: 3
},
{
    q: "Сколько будет трижды три?",
    a: ["8", "9", "10", "11"],
    rightAnswerIndex: 1
},
{
    q: "Сколько будет 2 + 2 * 2?",
    a: ["8", "9", "6", "3"],
    rightAnswerIndex: 2
},
{
    q: "Первая координата точки?",
    a: ["Абсцисса", "Ордината", "Ординатура", "Интернатура"],
    rightAnswerIndex: 0
},
{
    q: "Когда была доказана гипотеза Коллатца",
    a: ["В 1972 году", "В 2022 году", "В 2021 году", "Не доказана"],
    rightAnswerIndex: 3
},
{
    q: "Кто доказал гипотезу Римана",
    a: ["Риман", "Иванов", "Никто", "Варыгин"],
    rightAnswerIndex: 2
},
{
    q: "Что легче: 1 кг ваты или 1 кг железа?",
    a: ["Одинаково", "1 кг железа", "Нельзя сравнивать", "1 кг ваты"],
    rightAnswerIndex: 0
},
{
    q: "Кто сказал: «Математика - царица наук, а арифметика — царица математики»?",
    a: ["Архимед", "Аристотель", "Гаусс", "Пифагор"],
    rightAnswerIndex: 2
},
{
    q: "Как называется знак корня?",
    a: ["Радикал", "Интеграл", "Корешок", "Галочка"],
    rightAnswerIndex: 0
},
{
    q: "Какое событие позволило установить годы жизни Фалеса?",
    a: ["Война", "Землетрясение", "Наводнение", "Солнечное затмение"],
    rightAnswerIndex: 3
}
    ,
{
    q: "Чему равны длины сторон «египетского» треугольника?",
    a: ["3, 4, 5", "4, 5, 6", "2, 4 ,8", "3, 9, 27"],
    rightAnswerIndex: 0
},
{
    q: "Переведите на древнегреческий язык слова «натянутая тетива».",
    a: ["Тетраэдр", "Гипотенуза", "Теорема", "Трирема"],
    rightAnswerIndex: 1
}
    ,
{
    q: "50-е число последовательности Фибоначчи?",
    a: ["267914296", "12586269025", "1134903170", "2971215073"],
    rightAnswerIndex: 1
},
{
    q: "Чему равно 19x19?",
    a: ["341", "371", "321", "361"],
    rightAnswerIndex: 3
}
    ,
{
    q: "990001 простое или составное?",
    a: ["Да", "Составное", "Простое", "Нет"],
    rightAnswerIndex: 2
}]